lkolbly/cmsis-svd/data/TexasInstruments/LM4F232H5BB.svd
        <register>
          <name>RCGCSSI</name>
          <description>Synchronous Serial Interface Run Mode Clock Gating Control</description>
          <addressOffset>0x0000061C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RCGCSSI_R0</name>
              <description>SSI Module 0 Run Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCSSI_R1</name>
              <description>SSI Module 1 Run Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCSSI_R2</name>
              <description>SSI Module 2 Run Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCSSI_R3</name>
              <description>SSI Module 3 Run Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCI2C</name>
          <description>Inter-Integrated Circuit Run Mode Clock Gating Control</description>
          <addressOffset>0x00000620</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RCGCI2C_R0</name>
              <description>I2C Module 0 Run Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCI2C_R1</name>
              <description>I2C Module 1 Run Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCI2C_R2</name>
              <description>I2C Module 2 Run Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCI2C_R3</name>
              <description>I2C Module 3 Run Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCI2C_R4</name>
              <description>I2C Module 4 Run Mode Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCI2C_R5</name>
              <description>I2C Module 5 Run Mode Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCUSB</name>
          <description>Universal Serial Bus Run Mode Clock Gating Control</description>
          <addressOffset>0x00000628</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RCGCUSB_R0</name>
              <description>USB Module Run Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCCAN</name>
          <description>Controller Area Network Run Mode Clock Gating Control</description>
          <addressOffset>0x00000634</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RCGCCAN_R0</name>
              <description>CAN Module 0 Run Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCCAN_R1</name>
              <description>CAN Module 1 Run Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCADC</name>
          <description>Analog-to-Digital Converter Run Mode Clock Gating Control</description>
          <addressOffset>0x00000638</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RCGCADC_R0</name>
              <description>ADC Module 0 Run Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCADC_R1</name>
              <description>ADC Module 1 Run Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCACMP</name>
          <description>Analog Comparator Run Mode Clock Gating Control</description>
          <addressOffset>0x0000063C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RCGCACMP_R0</name>
              <description>Analog Comparator Module 0 Run Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCPWM</name>
          <description>Pulse Width Modulator Run Mode Clock Gating Control</description>
          <addressOffset>0x00000640</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RCGCPWM_R0</name>
              <description>PWM Module 0 Run Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCPWM_R1</name>
              <description>PWM Module 1 Run Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCQEI</name>
          <description>Quadrature Encoder Interface Run Mode Clock Gating Control</description>
          <addressOffset>0x00000644</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RCGCQEI_R0</name>
              <description>QEI Module 0 Run Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCQEI_R1</name>
              <description>QEI Module 1 Run Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCEEPROM</name>
          <description>EEPROM Run Mode Clock Gating Control</description>
          <addressOffset>0x00000658</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RCGCEEPROM_R0</name>
              <description>EEPROM Module Run Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCWTIMER</name>
          <description>Wide Timer Run Mode Clock Gating Control</description>
          <addressOffset>0x0000065C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RCGCWTIMER_R0</name>
              <description>Wide Timer 0 Run Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCWTIMER_R1</name>
              <description>Wide Timer 1 Run Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCWTIMER_R2</name>
              <description>Wide Timer 2 Run Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCWTIMER_R3</name>
              <description>Wide Timer 3 Run Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCWTIMER_R4</name>
              <description>Wide Timer 4 Run Mode Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCWTIMER_R5</name>
              <description>Wide Timer 5 Run Mode Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCWD</name>
          <description>Watchdog Timer Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000700</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SCGCWD_S0</name>
              <description>Watchdog Timer 0 Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCWD_S1</name>
              <description>Watchdog Timer 1 Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCTIMER</name>
          <description>Timer Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000704</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SCGCTIMER_S0</name>
              <description>Timer 0 Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCTIMER_S1</name>
              <description>Timer 1 Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCTIMER_S2</name>
              <description>Timer 2 Sleep Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCTIMER_S3</name>
              <description>Timer 3 Sleep Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCTIMER_S4</name>
              <description>Timer 4 Sleep Mode Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCTIMER_S5</name>
              <description>Timer 5 Sleep Mode Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCGPIO</name>
          <description>General-Purpose Input/Output Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000708</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SCGCGPIO_S0</name>
              <description>GPIO Port A Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCGPIO_S1</name>
              <description>GPIO Port B Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCGPIO_S2</name>
              <description>GPIO Port C Sleep Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCGPIO_S3</name>
              <description>GPIO Port D Sleep Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCGPIO_S4</name>
              <description>GPIO Port E Sleep Mode Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCGPIO_S5</name>
              <description>GPIO Port F Sleep Mode Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCGPIO_S6</name>
              <description>GPIO Port G Sleep Mode Clock Gating Control</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCGPIO_S7</name>
              <description>GPIO Port H Sleep Mode Clock Gating Control</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCGPIO_S8</name>
              <description>GPIO Port J Sleep Mode Clock Gating Control</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCGPIO_S9</name>
              <description>GPIO Port K Sleep Mode Clock Gating Control</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCGPIO_S10</name>
              <description>GPIO Port L Sleep Mode Clock Gating Control</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCGPIO_S11</name>
              <description>GPIO Port M Sleep Mode Clock Gating Control</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCGPIO_S12</name>
              <description>GPIO Port N Sleep Mode Clock Gating Control</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCGPIO_S13</name>
              <description>GPIO Port P Sleep Mode Clock Gating Control</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCGPIO_S14</name>
              <description>GPIO Port Q Sleep Mode Clock Gating Control</description>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCDMA</name>
          <description>Micro Direct Memory Access Sleep Mode Clock Gating Control</description>
          <addressOffset>0x0000070C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SCGCDMA_S0</name>
              <description>uDMA Module Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCHIB</name>
          <description>Hibernation Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000714</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SCGCHIB_S0</name>
              <description>Hibernation Module Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCUART</name>
          <description>Universal Asynchronous Receiver/Transmitter Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000718</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SCGCUART_S0</name>
              <description>UART Module 0 Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCUART_S1</name>
              <description>UART Module 1 Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCUART_S2</name>
              <description>UART Module 2 Sleep Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCUART_S3</name>
              <description>UART Module 3 Sleep Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCUART_S4</name>
              <description>UART Module 4 Sleep Mode Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCUART_S5</name>
              <description>UART Module 5 Sleep Mode Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCUART_S6</name>
              <description>UART Module 6 Sleep Mode Clock Gating Control</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCUART_S7</name>
              <description>UART Module 7 Sleep Mode Clock Gating Control</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCSSI</name>
          <description>Synchronous Serial Interface Sleep Mode Clock Gating Control</description>
          <addressOffset>0x0000071C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SCGCSSI_S0</name>
              <description>SSI Module 0 Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCSSI_S1</name>
              <description>SSI Module 1 Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCSSI_S2</name>
              <description>SSI Module 2 Sleep Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCSSI_S3</name>
              <description>SSI Module 3 Sleep Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCI2C</name>
          <description>Inter-Integrated Circuit Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000720</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SCGCI2C_S0</name>
              <description>I2C Module 0 Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCI2C_S1</name>
              <description>I2C Module 1 Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCI2C_S2</name>
              <description>I2C Module 2 Sleep Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCI2C_S3</name>
              <description>I2C Module 3 Sleep Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCI2C_S4</name>
              <description>I2C Module 4 Sleep Mode Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCI2C_S5</name>
              <description>I2C Module 5 Sleep Mode Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCUSB</name>
          <description>Universal Serial Bus Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000728</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SCGCUSB_S0</name>
              <description>USB Module Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCCAN</name>
          <description>Controller Area Network Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000734</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SCGCCAN_S0</name>
              <description>CAN Module 0 Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCCAN_S1</name>
              <description>CAN Module 1 Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCADC</name>
          <description>Analog-to-Digital Converter Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000738</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SCGCADC_S0</name>
              <description>ADC Module 0 Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCADC_S1</name>
              <description>ADC Module 1 Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCACMP</name>
          <description>Analog Comparator Sleep Mode Clock Gating Control</description>
          <addressOffset>0x0000073C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SCGCACMP_S0</name>
              <description>Analog Comparator Module 0 Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCPWM</name>
          <description>Pulse Width Modulator Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000740</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SCGCPWM_S0</name>
              <description>PWM Module 0 Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCPWM_S1</name>
              <description>PWM Module 1 Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCQEI</name>
          <description>Quadrature Encoder Interface Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000744</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SCGCQEI_S0</name>
              <description>QEI Module 0 Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SCGCQEI_S1</name>
              <description>QEI Module 1 Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCGCEEPROM</name>
          <description>EEPROM Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000758</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SCGCEEPROM_S0</name>
              <description>EEPROM Module Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
